import React from 'react';
import styled from 'styled-components';

const AppleLoginBtn: React.FC = () => {
  return (
    <AppleBtn>
      <svg
        width="21"
        height="25"
        viewBox="0 0 21 25"
        fill="none"
        xmlns="http://www.w3.org/2000/svg"
      >
        <path
          d="M14.4561 3.99742C15.2174 3.06254 15.7567 1.78917 15.7567 0.499678C15.7567 0.322373 15.7408 0.145068 15.7091 0C14.472 0.0483559 12.9811 0.83817 12.0929 1.902C11.3951 2.70793 10.7448 3.99742 10.7448 5.28691C10.7448 5.48034 10.7765 5.67376 10.7924 5.73823C10.8717 5.75435 10.9986 5.77047 11.1255 5.77047C12.2357 5.77047 13.6314 5.0129 14.4561 3.99742ZM15.3285 6.04449C13.4728 6.04449 11.9661 7.18891 10.9986 7.18891C9.96764 7.18891 8.6195 6.10896 7.00174 6.10896C3.94068 6.10896 0.832031 8.68794 0.832031 13.5397C0.832031 16.57 1.97398 19.7614 3.40142 21.8246C4.62267 23.5654 5.68532 25 7.22378 25C8.74638 25 9.41252 23.9684 11.2999 23.9684C13.219 23.9684 13.6473 24.9678 15.3285 24.9678C16.9938 24.9678 18.104 23.4204 19.1508 21.8891C20.3245 20.1322 20.8162 18.4236 20.832 18.343C20.7369 18.3108 17.5489 16.989 17.5489 13.2818C17.5489 10.0741 20.0549 8.63959 20.1976 8.52676C18.5481 6.10896 16.0263 6.04449 15.3285 6.04449Z"
          fill="black"
        />
      </svg>
      애플 계정으로 로그인
    </AppleBtn>
  );
};

const AppleBtn = styled.button`
  position: relative;
  margin-top: 8px;
  padding: 13px 0;
  width: 100%;
  background-color: ${({ theme }) => theme.grey.Gre0};
  border: none;
  border-radius: 4px;
  font: ${({ theme }) => theme.fontSizes.Body3};
  svg {
    position: absolute;
    top: 50%;
    left: 5%;
    width: 1.7rem;
    transform: translate(-0, -50%);
  }
`;

export default AppleLoginBtn;
